GogApp/LoadAndStressTests/LoadTests/ProjectController/result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 004/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 004/100 VUs  0m01.0s/2m00.0s

running (0m02.0s), 007/100 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 007/100 VUs  0m02.0s/2m00.0s

running (0m03.0s), 010/100 VUs, 9 complete and 0 interrupted iterations
default   [   2% ] 010/100 VUs  0m03.0s/2m00.0s

running (0m04.0s), 014/100 VUs, 18 complete and 0 interrupted iterations
default   [   3% ] 014/100 VUs  0m04.0s/2m00.0s

running (0m05.0s), 017/100 VUs, 28 complete and 0 interrupted iterations
default   [   4% ] 017/100 VUs  0m05.0s/2m00.0s

running (0m06.0s), 020/100 VUs, 42 complete and 0 interrupted iterations
default   [   5% ] 020/100 VUs  0m06.0s/2m00.0s

running (0m07.0s), 024/100 VUs, 57 complete and 0 interrupted iterations
default   [   6% ] 024/100 VUs  0m07.0s/2m00.0s

running (0m08.0s), 027/100 VUs, 78 complete and 0 interrupted iterations
default   [   7% ] 027/100 VUs  0m08.0s/2m00.0s

running (0m09.0s), 030/100 VUs, 97 complete and 0 interrupted iterations
default   [   7% ] 030/100 VUs  0m09.0s/2m00.0s

running (0m10.0s), 033/100 VUs, 123 complete and 0 interrupted iterations
default   [   8% ] 033/100 VUs  0m10.0s/2m00.0s

running (0m11.0s), 037/100 VUs, 150 complete and 0 interrupted iterations
default   [   9% ] 037/100 VUs  0m11.0s/2m00.0s

running (0m12.0s), 040/100 VUs, 177 complete and 0 interrupted iterations
default   [  10% ] 040/100 VUs  0m12.0s/2m00.0s

running (0m13.0s), 043/100 VUs, 213 complete and 0 interrupted iterations
default   [  11% ] 043/100 VUs  0m13.0s/2m00.0s

running (0m14.0s), 047/100 VUs, 244 complete and 0 interrupted iterations
default   [  12% ] 047/100 VUs  0m14.0s/2m00.0s

running (0m15.0s), 050/100 VUs, 276 complete and 0 interrupted iterations
default   [  12% ] 050/100 VUs  0m15.0s/2m00.0s

running (0m16.0s), 053/100 VUs, 325 complete and 0 interrupted iterations
default   [  13% ] 053/100 VUs  0m16.0s/2m00.0s

running (0m17.0s), 057/100 VUs, 367 complete and 0 interrupted iterations
default   [  14% ] 057/100 VUs  0m17.0s/2m00.0s

running (0m18.0s), 060/100 VUs, 414 complete and 0 interrupted iterations
default   [  15% ] 060/100 VUs  0m18.0s/2m00.0s

running (0m19.0s), 063/100 VUs, 466 complete and 0 interrupted iterations
default   [  16% ] 063/100 VUs  0m19.0s/2m00.0s

running (0m20.0s), 066/100 VUs, 516 complete and 0 interrupted iterations
default   [  17% ] 066/100 VUs  0m20.0s/2m00.0s

running (0m21.0s), 070/100 VUs, 570 complete and 0 interrupted iterations
default   [  17% ] 070/100 VUs  0m21.0s/2m00.0s

running (0m22.0s), 073/100 VUs, 628 complete and 0 interrupted iterations
default   [  18% ] 073/100 VUs  0m22.0s/2m00.0s

running (0m23.0s), 076/100 VUs, 685 complete and 0 interrupted iterations
default   [  19% ] 076/100 VUs  0m23.0s/2m00.0s

running (0m24.0s), 080/100 VUs, 745 complete and 0 interrupted iterations
default   [  20% ] 080/100 VUs  0m24.0s/2m00.0s

running (0m25.0s), 083/100 VUs, 814 complete and 0 interrupted iterations
default   [  21% ] 083/100 VUs  0m25.0s/2m00.0s

running (0m26.0s), 086/100 VUs, 891 complete and 0 interrupted iterations
default   [  22% ] 086/100 VUs  0m26.0s/2m00.0s

running (0m27.0s), 090/100 VUs, 945 complete and 0 interrupted iterations
default   [  22% ] 090/100 VUs  0m27.0s/2m00.0s

running (0m28.0s), 093/100 VUs, 1023 complete and 0 interrupted iterations
default   [  23% ] 093/100 VUs  0m28.0s/2m00.0s

running (0m29.0s), 096/100 VUs, 1086 complete and 0 interrupted iterations
default   [  24% ] 096/100 VUs  0m29.0s/2m00.0s

running (0m30.0s), 099/100 VUs, 1160 complete and 0 interrupted iterations
default   [  25% ] 099/100 VUs  0m30.0s/2m00.0s

running (0m31.0s), 100/100 VUs, 1236 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  0m31.0s/2m00.0s

running (0m32.0s), 100/100 VUs, 1310 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  0m32.0s/2m00.0s

running (0m33.0s), 100/100 VUs, 1404 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  0m33.0s/2m00.0s

running (0m34.0s), 100/100 VUs, 1479 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  0m34.0s/2m00.0s

running (0m35.0s), 100/100 VUs, 1573 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  0m35.0s/2m00.0s

running (0m36.0s), 100/100 VUs, 1653 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  0m36.0s/2m00.0s

running (0m37.0s), 100/100 VUs, 1733 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  0m37.0s/2m00.0s

running (0m38.0s), 100/100 VUs, 1829 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  0m38.0s/2m00.0s

running (0m39.0s), 100/100 VUs, 1904 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  0m39.0s/2m00.0s

running (0m40.0s), 100/100 VUs, 2001 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  0m40.0s/2m00.0s

running (0m41.0s), 100/100 VUs, 2079 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  0m41.0s/2m00.0s

running (0m42.0s), 100/100 VUs, 2170 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  0m42.0s/2m00.0s

running (0m43.0s), 100/100 VUs, 2252 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  0m43.0s/2m00.0s

running (0m44.0s), 100/100 VUs, 2329 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  0m44.0s/2m00.0s

running (0m45.0s), 100/100 VUs, 2416 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  0m45.0s/2m00.0s

running (0m46.0s), 100/100 VUs, 2495 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  0m46.0s/2m00.0s

running (0m47.0s), 100/100 VUs, 2587 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  0m47.0s/2m00.0s

running (0m48.0s), 100/100 VUs, 2673 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  0m48.0s/2m00.0s

running (0m49.0s), 100/100 VUs, 2751 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  0m49.0s/2m00.0s

running (0m50.0s), 100/100 VUs, 2843 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  0m50.0s/2m00.0s

running (0m51.0s), 100/100 VUs, 2915 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  0m51.0s/2m00.0s

running (0m52.0s), 100/100 VUs, 2989 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  0m52.0s/2m00.0s

running (0m53.0s), 100/100 VUs, 3089 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  0m53.0s/2m00.0s

running (0m54.0s), 100/100 VUs, 3161 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  0m54.0s/2m00.0s

running (0m55.0s), 100/100 VUs, 3239 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  0m55.0s/2m00.0s

running (0m56.0s), 100/100 VUs, 3329 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  0m56.0s/2m00.0s

running (0m57.0s), 100/100 VUs, 3412 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  0m57.0s/2m00.0s

running (0m58.0s), 100/100 VUs, 3495 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  0m58.0s/2m00.0s

running (0m59.0s), 100/100 VUs, 3567 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  0m59.0s/2m00.0s

running (1m00.0s), 100/100 VUs, 3648 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  1m00.0s/2m00.0s

running (1m01.0s), 100/100 VUs, 3745 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m01.0s/2m00.0s

running (1m02.0s), 100/100 VUs, 3823 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  1m02.0s/2m00.0s

running (1m03.0s), 100/100 VUs, 3908 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  1m03.0s/2m00.0s

running (1m04.0s), 100/100 VUs, 3996 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  1m04.0s/2m00.0s

running (1m05.0s), 100/100 VUs, 4074 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  1m05.0s/2m00.0s

running (1m06.0s), 100/100 VUs, 4145 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  1m06.0s/2m00.0s

running (1m07.0s), 100/100 VUs, 4225 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  1m07.0s/2m00.0s

running (1m08.0s), 100/100 VUs, 4320 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  1m08.0s/2m00.0s

running (1m09.0s), 100/100 VUs, 4398 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  1m09.0s/2m00.0s

running (1m10.0s), 100/100 VUs, 4498 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m10.0s/2m00.0s

running (1m11.0s), 100/100 VUs, 4586 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m11.0s/2m00.0s

running (1m12.0s), 100/100 VUs, 4657 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  1m12.0s/2m00.0s

running (1m13.0s), 100/100 VUs, 4725 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m13.0s/2m00.0s

running (1m14.0s), 100/100 VUs, 4824 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m14.0s/2m00.0s

running (1m15.1s), 100/100 VUs, 4898 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m15.0s/2m00.0s

running (1m16.0s), 100/100 VUs, 4926 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m16.0s/2m00.0s

running (1m17.0s), 100/100 VUs, 5002 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m17.0s/2m00.0s

running (1m18.0s), 100/100 VUs, 5082 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m18.0s/2m00.0s

running (1m19.0s), 100/100 VUs, 5145 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m19.0s/2m00.0s

running (1m20.0s), 100/100 VUs, 5223 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m20.0s/2m00.0s

running (1m21.0s), 100/100 VUs, 5290 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m21.0s/2m00.0s

running (1m22.0s), 100/100 VUs, 5376 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m22.0s/2m00.0s

running (1m23.0s), 100/100 VUs, 5457 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m23.0s/2m00.0s

running (1m24.0s), 100/100 VUs, 5541 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  1m24.0s/2m00.0s

running (1m25.0s), 100/100 VUs, 5616 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m25.0s/2m00.0s

running (1m26.0s), 100/100 VUs, 5704 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m26.0s/2m00.0s

running (1m27.0s), 100/100 VUs, 5776 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m27.0s/2m00.0s

running (1m28.0s), 100/100 VUs, 5862 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m28.0s/2m00.0s

running (1m29.0s), 100/100 VUs, 5934 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m29.0s/2m00.0s

running (1m30.0s), 100/100 VUs, 6031 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  1m30.0s/2m00.0s

running (1m31.0s), 098/100 VUs, 6128 complete and 0 interrupted iterations
default   [  76% ] 098/100 VUs  1m31.0s/2m00.0s

running (1m32.0s), 097/100 VUs, 6205 complete and 0 interrupted iterations
default   [  77% ] 097/100 VUs  1m32.0s/2m00.0s

running (1m33.0s), 092/100 VUs, 6301 complete and 0 interrupted iterations
default   [  77% ] 092/100 VUs  1m33.0s/2m00.0s

running (1m34.0s), 089/100 VUs, 6359 complete and 0 interrupted iterations
default   [  78% ] 089/100 VUs  1m34.0s/2m00.0s

running (1m35.0s), 088/100 VUs, 6420 complete and 0 interrupted iterations
default   [  79% ] 088/100 VUs  1m35.0s/2m00.0s

running (1m36.0s), 085/100 VUs, 6480 complete and 0 interrupted iterations
default   [  80% ] 085/100 VUs  1m36.0s/2m00.0s

running (1m37.0s), 078/100 VUs, 6558 complete and 0 interrupted iterations
default   [  81% ] 078/100 VUs  1m37.0s/2m00.0s

running (1m38.0s), 075/100 VUs, 6616 complete and 0 interrupted iterations
default   [  82% ] 075/100 VUs  1m38.0s/2m00.0s

running (1m39.0s), 072/100 VUs, 6677 complete and 0 interrupted iterations
default   [  82% ] 072/100 VUs  1m39.0s/2m00.0s

running (1m40.0s), 069/100 VUs, 6729 complete and 0 interrupted iterations
default   [  83% ] 069/100 VUs  1m40.0s/2m00.0s

running (1m41.0s), 067/100 VUs, 6796 complete and 0 interrupted iterations
default   [  84% ] 067/100 VUs  1m41.0s/2m00.0s

running (1m42.0s), 061/100 VUs, 6859 complete and 0 interrupted iterations
default   [  85% ] 061/100 VUs  1m42.0s/2m00.0s

running (1m43.0s), 058/100 VUs, 6917 complete and 0 interrupted iterations
default   [  86% ] 058/100 VUs  1m43.0s/2m00.0s

running (1m44.0s), 056/100 VUs, 6957 complete and 0 interrupted iterations
default   [  87% ] 056/100 VUs  1m44.0s/2m00.0s

running (1m45.0s), 053/100 VUs, 6999 complete and 0 interrupted iterations
default   [  87% ] 053/100 VUs  1m45.0s/2m00.0s

running (1m46.0s), 050/100 VUs, 7037 complete and 0 interrupted iterations
default   [  88% ] 050/100 VUs  1m46.0s/2m00.0s

running (1m47.0s), 045/100 VUs, 7087 complete and 0 interrupted iterations
default   [  89% ] 045/100 VUs  1m47.0s/2m00.0s

running (1m48.0s), 043/100 VUs, 7131 complete and 0 interrupted iterations
default   [  90% ] 043/100 VUs  1m48.0s/2m00.0s

running (1m49.0s), 039/100 VUs, 7169 complete and 0 interrupted iterations
default   [  91% ] 039/100 VUs  1m49.0s/2m00.0s

running (1m50.0s), 037/100 VUs, 7185 complete and 0 interrupted iterations
default   [  92% ] 037/100 VUs  1m50.0s/2m00.0s

running (1m51.0s), 034/100 VUs, 7213 complete and 0 interrupted iterations
default   [  92% ] 034/100 VUs  1m51.0s/2m00.0s

running (1m52.0s), 029/100 VUs, 7247 complete and 0 interrupted iterations
default   [  93% ] 029/100 VUs  1m52.0s/2m00.0s

running (1m53.0s), 026/100 VUs, 7276 complete and 0 interrupted iterations
default   [  94% ] 026/100 VUs  1m53.0s/2m00.0s

running (1m54.0s), 021/100 VUs, 7302 complete and 0 interrupted iterations
default   [  95% ] 021/100 VUs  1m54.0s/2m00.0s

running (1m55.0s), 018/100 VUs, 7322 complete and 0 interrupted iterations
default   [  96% ] 018/100 VUs  1m55.0s/2m00.0s

running (1m56.0s), 017/100 VUs, 7327 complete and 0 interrupted iterations
default   [  97% ] 017/100 VUs  1m56.0s/2m00.0s

running (1m57.0s), 013/100 VUs, 7344 complete and 0 interrupted iterations
default   [  97% ] 013/100 VUs  1m57.0s/2m00.0s

running (1m58.0s), 010/100 VUs, 7354 complete and 0 interrupted iterations
default   [  98% ] 010/100 VUs  1m58.0s/2m00.0s

running (1m59.0s), 005/100 VUs, 7364 complete and 0 interrupted iterations
default   [  99% ] 005/100 VUs  1m59.0s/2m00.0s

running (2m00.0s), 002/100 VUs, 7369 complete and 0 interrupted iterations
default   [ 100% ] 002/100 VUs  2m00.0s/2m00.0s

     █ Create Project

       ✗ project created successfully
        ↳  0% — ✓ 0 / ✗ 7371

     █ View Project Details

       ✗ project details fetched
        ↳  0% — ✓ 0 / ✗ 7371

     checks.........................: 0.00%  0 out of 14742
     data_received..................: 55 MB  458 kB/s
     data_sent......................: 4.5 MB 37 kB/s
     group_duration.................: avg=114.26ms min=336.66µs med=165.11ms max=2.76s    p(90)=184.31ms p(95)=235.51ms
     http_req_blocked...............: avg=25.06µs  min=0s       med=3µs      max=133.23ms p(90)=8µs      p(95)=12µs    
     http_req_connecting............: avg=3.79µs   min=0s       med=0s       max=13.49ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=113.84ms min=292µs    med=164.93ms max=2.76s    p(90)=184.08ms p(95)=234.56ms
       { expected_response:true }...: avg=6ms      min=292µs    med=1.24ms   max=465.31ms p(90)=5.05ms   p(95)=14.22ms 
     http_req_failed................: 50.00% 7371 out of 14742
     http_req_receiving.............: avg=133.62µs min=4µs      med=39µs     max=68.02ms  p(90)=94µs     p(95)=126µs   
     http_req_sending...............: avg=93.31µs  min=2µs      med=11µs     max=177.84ms p(90)=30.9µs   p(95)=47µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=113.61ms min=267µs    med=164.86ms max=2.76s    p(90)=183.97ms p(95)=233.42ms
     http_reqs......................: 14742  121.911485/s
     iteration_duration.............: avg=1.23s    min=1.16s    med=1.17s    max=3.76s    p(90)=1.25s    p(95)=1.48s   
     iterations.....................: 7371   60.955742/s
     vus............................: 2      min=2             max=100
     vus_max........................: 100    min=100           max=100


running (2m00.9s), 000/100 VUs, 7371 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m0s